vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/port.h
#define PORT_OUTCLR_OUT0CLR_Pos               _UINT32_(0)                                          /* (PORT_OUTCLR) PORT Data Output Value 0 Clear Position */
#define PORT_OUTCLR_OUT0CLR_Msk               (_UINT32_(0x1) << PORT_OUTCLR_OUT0CLR_Pos)           /* (PORT_OUTCLR) PORT Data Output Value 0 Clear Mask */
#define PORT_OUTCLR_OUT0CLR(value)            (PORT_OUTCLR_OUT0CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT0CLR_Pos)) /* Assignment of value for OUT0CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT1CLR_Pos               _UINT32_(1)                                          /* (PORT_OUTCLR) PORT Data Output Value 1 Clear Position */
#define PORT_OUTCLR_OUT1CLR_Msk               (_UINT32_(0x1) << PORT_OUTCLR_OUT1CLR_Pos)           /* (PORT_OUTCLR) PORT Data Output Value 1 Clear Mask */
#define PORT_OUTCLR_OUT1CLR(value)            (PORT_OUTCLR_OUT1CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT1CLR_Pos)) /* Assignment of value for OUT1CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT2CLR_Pos               _UINT32_(2)                                          /* (PORT_OUTCLR) PORT Data Output Value 2 Clear Position */
#define PORT_OUTCLR_OUT2CLR_Msk               (_UINT32_(0x1) << PORT_OUTCLR_OUT2CLR_Pos)           /* (PORT_OUTCLR) PORT Data Output Value 2 Clear Mask */
#define PORT_OUTCLR_OUT2CLR(value)            (PORT_OUTCLR_OUT2CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT2CLR_Pos)) /* Assignment of value for OUT2CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT3CLR_Pos               _UINT32_(3)                                          /* (PORT_OUTCLR) PORT Data Output Value 3 Clear Position */
#define PORT_OUTCLR_OUT3CLR_Msk               (_UINT32_(0x1) << PORT_OUTCLR_OUT3CLR_Pos)           /* (PORT_OUTCLR) PORT Data Output Value 3 Clear Mask */
#define PORT_OUTCLR_OUT3CLR(value)            (PORT_OUTCLR_OUT3CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT3CLR_Pos)) /* Assignment of value for OUT3CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT4CLR_Pos               _UINT32_(4)                                          /* (PORT_OUTCLR) PORT Data Output Value 4 Clear Position */
#define PORT_OUTCLR_OUT4CLR_Msk               (_UINT32_(0x1) << PORT_OUTCLR_OUT4CLR_Pos)           /* (PORT_OUTCLR) PORT Data Output Value 4 Clear Mask */
#define PORT_OUTCLR_OUT4CLR(value)            (PORT_OUTCLR_OUT4CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT4CLR_Pos)) /* Assignment of value for OUT4CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT5CLR_Pos               _UINT32_(5)                                          /* (PORT_OUTCLR) PORT Data Output Value 5 Clear Position */
#define PORT_OUTCLR_OUT5CLR_Msk               (_UINT32_(0x1) << PORT_OUTCLR_OUT5CLR_Pos)           /* (PORT_OUTCLR) PORT Data Output Value 5 Clear Mask */
#define PORT_OUTCLR_OUT5CLR(value)            (PORT_OUTCLR_OUT5CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT5CLR_Pos)) /* Assignment of value for OUT5CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT6CLR_Pos               _UINT32_(6)                                          /* (PORT_OUTCLR) PORT Data Output Value 6 Clear Position */
#define PORT_OUTCLR_OUT6CLR_Msk               (_UINT32_(0x1) << PORT_OUTCLR_OUT6CLR_Pos)           /* (PORT_OUTCLR) PORT Data Output Value 6 Clear Mask */
#define PORT_OUTCLR_OUT6CLR(value)            (PORT_OUTCLR_OUT6CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT6CLR_Pos)) /* Assignment of value for OUT6CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT7CLR_Pos               _UINT32_(7)                                          /* (PORT_OUTCLR) PORT Data Output Value 7 Clear Position */
#define PORT_OUTCLR_OUT7CLR_Msk               (_UINT32_(0x1) << PORT_OUTCLR_OUT7CLR_Pos)           /* (PORT_OUTCLR) PORT Data Output Value 7 Clear Mask */
#define PORT_OUTCLR_OUT7CLR(value)            (PORT_OUTCLR_OUT7CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT7CLR_Pos)) /* Assignment of value for OUT7CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT8CLR_Pos               _UINT32_(8)                                          /* (PORT_OUTCLR) PORT Data Output Value 8 Clear Position */
#define PORT_OUTCLR_OUT8CLR_Msk               (_UINT32_(0x1) << PORT_OUTCLR_OUT8CLR_Pos)           /* (PORT_OUTCLR) PORT Data Output Value 8 Clear Mask */
#define PORT_OUTCLR_OUT8CLR(value)            (PORT_OUTCLR_OUT8CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT8CLR_Pos)) /* Assignment of value for OUT8CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT9CLR_Pos               _UINT32_(9)                                          /* (PORT_OUTCLR) PORT Data Output Value 9 Clear Position */
#define PORT_OUTCLR_OUT9CLR_Msk               (_UINT32_(0x1) << PORT_OUTCLR_OUT9CLR_Pos)           /* (PORT_OUTCLR) PORT Data Output Value 9 Clear Mask */
#define PORT_OUTCLR_OUT9CLR(value)            (PORT_OUTCLR_OUT9CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT9CLR_Pos)) /* Assignment of value for OUT9CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT10CLR_Pos              _UINT32_(10)                                         /* (PORT_OUTCLR) PORT Data Output Value 10 Clear Position */
#define PORT_OUTCLR_OUT10CLR_Msk              (_UINT32_(0x1) << PORT_OUTCLR_OUT10CLR_Pos)          /* (PORT_OUTCLR) PORT Data Output Value 10 Clear Mask */
#define PORT_OUTCLR_OUT10CLR(value)           (PORT_OUTCLR_OUT10CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT10CLR_Pos)) /* Assignment of value for OUT10CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT11CLR_Pos              _UINT32_(11)                                         /* (PORT_OUTCLR) PORT Data Output Value 11 Clear Position */
#define PORT_OUTCLR_OUT11CLR_Msk              (_UINT32_(0x1) << PORT_OUTCLR_OUT11CLR_Pos)          /* (PORT_OUTCLR) PORT Data Output Value 11 Clear Mask */
#define PORT_OUTCLR_OUT11CLR(value)           (PORT_OUTCLR_OUT11CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT11CLR_Pos)) /* Assignment of value for OUT11CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT12CLR_Pos              _UINT32_(12)                                         /* (PORT_OUTCLR) PORT Data Output Value 12 Clear Position */
#define PORT_OUTCLR_OUT12CLR_Msk              (_UINT32_(0x1) << PORT_OUTCLR_OUT12CLR_Pos)          /* (PORT_OUTCLR) PORT Data Output Value 12 Clear Mask */
#define PORT_OUTCLR_OUT12CLR(value)           (PORT_OUTCLR_OUT12CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT12CLR_Pos)) /* Assignment of value for OUT12CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT13CLR_Pos              _UINT32_(13)                                         /* (PORT_OUTCLR) PORT Data Output Value 13 Clear Position */
#define PORT_OUTCLR_OUT13CLR_Msk              (_UINT32_(0x1) << PORT_OUTCLR_OUT13CLR_Pos)          /* (PORT_OUTCLR) PORT Data Output Value 13 Clear Mask */
#define PORT_OUTCLR_OUT13CLR(value)           (PORT_OUTCLR_OUT13CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT13CLR_Pos)) /* Assignment of value for OUT13CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT14CLR_Pos              _UINT32_(14)                                         /* (PORT_OUTCLR) PORT Data Output Value 14 Clear Position */
#define PORT_OUTCLR_OUT14CLR_Msk              (_UINT32_(0x1) << PORT_OUTCLR_OUT14CLR_Pos)          /* (PORT_OUTCLR) PORT Data Output Value 14 Clear Mask */
#define PORT_OUTCLR_OUT14CLR(value)           (PORT_OUTCLR_OUT14CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT14CLR_Pos)) /* Assignment of value for OUT14CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT15CLR_Pos              _UINT32_(15)                                         /* (PORT_OUTCLR) PORT Data Output Value 15 Clear Position */
#define PORT_OUTCLR_OUT15CLR_Msk              (_UINT32_(0x1) << PORT_OUTCLR_OUT15CLR_Pos)          /* (PORT_OUTCLR) PORT Data Output Value 15 Clear Mask */
#define PORT_OUTCLR_OUT15CLR(value)           (PORT_OUTCLR_OUT15CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT15CLR_Pos)) /* Assignment of value for OUT15CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT16CLR_Pos              _UINT32_(16)                                         /* (PORT_OUTCLR) PORT Data Output Value 16 Clear Position */
#define PORT_OUTCLR_OUT16CLR_Msk              (_UINT32_(0x1) << PORT_OUTCLR_OUT16CLR_Pos)          /* (PORT_OUTCLR) PORT Data Output Value 16 Clear Mask */
#define PORT_OUTCLR_OUT16CLR(value)           (PORT_OUTCLR_OUT16CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT16CLR_Pos)) /* Assignment of value for OUT16CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT17CLR_Pos              _UINT32_(17)                                         /* (PORT_OUTCLR) PORT Data Output Value 17 Clear Position */
#define PORT_OUTCLR_OUT17CLR_Msk              (_UINT32_(0x1) << PORT_OUTCLR_OUT17CLR_Pos)          /* (PORT_OUTCLR) PORT Data Output Value 17 Clear Mask */
#define PORT_OUTCLR_OUT17CLR(value)           (PORT_OUTCLR_OUT17CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT17CLR_Pos)) /* Assignment of value for OUT17CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT18CLR_Pos              _UINT32_(18)                                         /* (PORT_OUTCLR) PORT Data Output Value 18 Clear Position */
#define PORT_OUTCLR_OUT18CLR_Msk              (_UINT32_(0x1) << PORT_OUTCLR_OUT18CLR_Pos)          /* (PORT_OUTCLR) PORT Data Output Value 18 Clear Mask */
#define PORT_OUTCLR_OUT18CLR(value)           (PORT_OUTCLR_OUT18CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT18CLR_Pos)) /* Assignment of value for OUT18CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT19CLR_Pos              _UINT32_(19)                                         /* (PORT_OUTCLR) PORT Data Output Value 19 Clear Position */
#define PORT_OUTCLR_OUT19CLR_Msk              (_UINT32_(0x1) << PORT_OUTCLR_OUT19CLR_Pos)          /* (PORT_OUTCLR) PORT Data Output Value 19 Clear Mask */
#define PORT_OUTCLR_OUT19CLR(value)           (PORT_OUTCLR_OUT19CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT19CLR_Pos)) /* Assignment of value for OUT19CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT20CLR_Pos              _UINT32_(20)                                         /* (PORT_OUTCLR) PORT Data Output Value 20 Clear Position */
#define PORT_OUTCLR_OUT20CLR_Msk              (_UINT32_(0x1) << PORT_OUTCLR_OUT20CLR_Pos)          /* (PORT_OUTCLR) PORT Data Output Value 20 Clear Mask */
#define PORT_OUTCLR_OUT20CLR(value)           (PORT_OUTCLR_OUT20CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT20CLR_Pos)) /* Assignment of value for OUT20CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT21CLR_Pos              _UINT32_(21)                                         /* (PORT_OUTCLR) PORT Data Output Value 21 Clear Position */
#define PORT_OUTCLR_OUT21CLR_Msk              (_UINT32_(0x1) << PORT_OUTCLR_OUT21CLR_Pos)          /* (PORT_OUTCLR) PORT Data Output Value 21 Clear Mask */
#define PORT_OUTCLR_OUT21CLR(value)           (PORT_OUTCLR_OUT21CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT21CLR_Pos)) /* Assignment of value for OUT21CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT22CLR_Pos              _UINT32_(22)                                         /* (PORT_OUTCLR) PORT Data Output Value 22 Clear Position */
#define PORT_OUTCLR_OUT22CLR_Msk              (_UINT32_(0x1) << PORT_OUTCLR_OUT22CLR_Pos)          /* (PORT_OUTCLR) PORT Data Output Value 22 Clear Mask */
#define PORT_OUTCLR_OUT22CLR(value)           (PORT_OUTCLR_OUT22CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT22CLR_Pos)) /* Assignment of value for OUT22CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT23CLR_Pos              _UINT32_(23)                                         /* (PORT_OUTCLR) PORT Data Output Value 23 Clear Position */
#define PORT_OUTCLR_OUT23CLR_Msk              (_UINT32_(0x1) << PORT_OUTCLR_OUT23CLR_Pos)          /* (PORT_OUTCLR) PORT Data Output Value 23 Clear Mask */
#define PORT_OUTCLR_OUT23CLR(value)           (PORT_OUTCLR_OUT23CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT23CLR_Pos)) /* Assignment of value for OUT23CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT24CLR_Pos              _UINT32_(24)                                         /* (PORT_OUTCLR) PORT Data Output Value 24 Clear Position */
#define PORT_OUTCLR_OUT24CLR_Msk              (_UINT32_(0x1) << PORT_OUTCLR_OUT24CLR_Pos)          /* (PORT_OUTCLR) PORT Data Output Value 24 Clear Mask */
#define PORT_OUTCLR_OUT24CLR(value)           (PORT_OUTCLR_OUT24CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT24CLR_Pos)) /* Assignment of value for OUT24CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT25CLR_Pos              _UINT32_(25)                                         /* (PORT_OUTCLR) PORT Data Output Value 25 Clear Position */
#define PORT_OUTCLR_OUT25CLR_Msk              (_UINT32_(0x1) << PORT_OUTCLR_OUT25CLR_Pos)          /* (PORT_OUTCLR) PORT Data Output Value 25 Clear Mask */
#define PORT_OUTCLR_OUT25CLR(value)           (PORT_OUTCLR_OUT25CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT25CLR_Pos)) /* Assignment of value for OUT25CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT26CLR_Pos              _UINT32_(26)                                         /* (PORT_OUTCLR) PORT Data Output Value 26 Clear Position */
#define PORT_OUTCLR_OUT26CLR_Msk              (_UINT32_(0x1) << PORT_OUTCLR_OUT26CLR_Pos)          /* (PORT_OUTCLR) PORT Data Output Value 26 Clear Mask */
#define PORT_OUTCLR_OUT26CLR(value)           (PORT_OUTCLR_OUT26CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT26CLR_Pos)) /* Assignment of value for OUT26CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT27CLR_Pos              _UINT32_(27)                                         /* (PORT_OUTCLR) PORT Data Output Value 27 Clear Position */
#define PORT_OUTCLR_OUT27CLR_Msk              (_UINT32_(0x1) << PORT_OUTCLR_OUT27CLR_Pos)          /* (PORT_OUTCLR) PORT Data Output Value 27 Clear Mask */
#define PORT_OUTCLR_OUT27CLR(value)           (PORT_OUTCLR_OUT27CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT27CLR_Pos)) /* Assignment of value for OUT27CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT28CLR_Pos              _UINT32_(28)                                         /* (PORT_OUTCLR) PORT Data Output Value 28 Clear Position */
#define PORT_OUTCLR_OUT28CLR_Msk              (_UINT32_(0x1) << PORT_OUTCLR_OUT28CLR_Pos)          /* (PORT_OUTCLR) PORT Data Output Value 28 Clear Mask */
#define PORT_OUTCLR_OUT28CLR(value)           (PORT_OUTCLR_OUT28CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT28CLR_Pos)) /* Assignment of value for OUT28CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT29CLR_Pos              _UINT32_(29)                                         /* (PORT_OUTCLR) PORT Data Output Value 29 Clear Position */
#define PORT_OUTCLR_OUT29CLR_Msk              (_UINT32_(0x1) << PORT_OUTCLR_OUT29CLR_Pos)          /* (PORT_OUTCLR) PORT Data Output Value 29 Clear Mask */
#define PORT_OUTCLR_OUT29CLR(value)           (PORT_OUTCLR_OUT29CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT29CLR_Pos)) /* Assignment of value for OUT29CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT30CLR_Pos              _UINT32_(30)                                         /* (PORT_OUTCLR) PORT Data Output Value 30 Clear Position */
#define PORT_OUTCLR_OUT30CLR_Msk              (_UINT32_(0x1) << PORT_OUTCLR_OUT30CLR_Pos)          /* (PORT_OUTCLR) PORT Data Output Value 30 Clear Mask */
#define PORT_OUTCLR_OUT30CLR(value)           (PORT_OUTCLR_OUT30CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT30CLR_Pos)) /* Assignment of value for OUT30CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_OUT31CLR_Pos              _UINT32_(31)                                         /* (PORT_OUTCLR) PORT Data Output Value 31 Clear Position */
#define PORT_OUTCLR_OUT31CLR_Msk              (_UINT32_(0x1) << PORT_OUTCLR_OUT31CLR_Pos)          /* (PORT_OUTCLR) PORT Data Output Value 31 Clear Mask */
#define PORT_OUTCLR_OUT31CLR(value)           (PORT_OUTCLR_OUT31CLR_Msk & (_UINT32_(value) << PORT_OUTCLR_OUT31CLR_Pos)) /* Assignment of value for OUT31CLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (PORT_OUTCLR) Register Mask  */


/* -------- PORT_OUTSET : (PORT Offset: 0x18) (R/W 32) Data Output Value Set -------- */
#define PORT_OUTSET_RESETVALUE                _UINT32_(0x00)                                       /*  (PORT_OUTSET) Data Output Value Set  Reset Value */

