vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/port.h
#define PORT_OUTSET_OUT0SET_Pos               _UINT32_(0)                                          /* (PORT_OUTSET) PORT Data Output Value 0 Set Position */
#define PORT_OUTSET_OUT0SET_Msk               (_UINT32_(0x1) << PORT_OUTSET_OUT0SET_Pos)           /* (PORT_OUTSET) PORT Data Output Value 0 Set Mask */
#define PORT_OUTSET_OUT0SET(value)            (PORT_OUTSET_OUT0SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT0SET_Pos)) /* Assignment of value for OUT0SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT1SET_Pos               _UINT32_(1)                                          /* (PORT_OUTSET) PORT Data Output Value 1 Set Position */
#define PORT_OUTSET_OUT1SET_Msk               (_UINT32_(0x1) << PORT_OUTSET_OUT1SET_Pos)           /* (PORT_OUTSET) PORT Data Output Value 1 Set Mask */
#define PORT_OUTSET_OUT1SET(value)            (PORT_OUTSET_OUT1SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT1SET_Pos)) /* Assignment of value for OUT1SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT2SET_Pos               _UINT32_(2)                                          /* (PORT_OUTSET) PORT Data Output Value 2 Set Position */
#define PORT_OUTSET_OUT2SET_Msk               (_UINT32_(0x1) << PORT_OUTSET_OUT2SET_Pos)           /* (PORT_OUTSET) PORT Data Output Value 2 Set Mask */
#define PORT_OUTSET_OUT2SET(value)            (PORT_OUTSET_OUT2SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT2SET_Pos)) /* Assignment of value for OUT2SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT3SET_Pos               _UINT32_(3)                                          /* (PORT_OUTSET) PORT Data Output Value 3 Set Position */
#define PORT_OUTSET_OUT3SET_Msk               (_UINT32_(0x1) << PORT_OUTSET_OUT3SET_Pos)           /* (PORT_OUTSET) PORT Data Output Value 3 Set Mask */
#define PORT_OUTSET_OUT3SET(value)            (PORT_OUTSET_OUT3SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT3SET_Pos)) /* Assignment of value for OUT3SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT4SET_Pos               _UINT32_(4)                                          /* (PORT_OUTSET) PORT Data Output Value 4 Set Position */
#define PORT_OUTSET_OUT4SET_Msk               (_UINT32_(0x1) << PORT_OUTSET_OUT4SET_Pos)           /* (PORT_OUTSET) PORT Data Output Value 4 Set Mask */
#define PORT_OUTSET_OUT4SET(value)            (PORT_OUTSET_OUT4SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT4SET_Pos)) /* Assignment of value for OUT4SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT5SET_Pos               _UINT32_(5)                                          /* (PORT_OUTSET) PORT Data Output Value 5 Set Position */
#define PORT_OUTSET_OUT5SET_Msk               (_UINT32_(0x1) << PORT_OUTSET_OUT5SET_Pos)           /* (PORT_OUTSET) PORT Data Output Value 5 Set Mask */
#define PORT_OUTSET_OUT5SET(value)            (PORT_OUTSET_OUT5SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT5SET_Pos)) /* Assignment of value for OUT5SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT6SET_Pos               _UINT32_(6)                                          /* (PORT_OUTSET) PORT Data Output Value 6 Set Position */
#define PORT_OUTSET_OUT6SET_Msk               (_UINT32_(0x1) << PORT_OUTSET_OUT6SET_Pos)           /* (PORT_OUTSET) PORT Data Output Value 6 Set Mask */
#define PORT_OUTSET_OUT6SET(value)            (PORT_OUTSET_OUT6SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT6SET_Pos)) /* Assignment of value for OUT6SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT7SET_Pos               _UINT32_(7)                                          /* (PORT_OUTSET) PORT Data Output Value 7 Set Position */
#define PORT_OUTSET_OUT7SET_Msk               (_UINT32_(0x1) << PORT_OUTSET_OUT7SET_Pos)           /* (PORT_OUTSET) PORT Data Output Value 7 Set Mask */
#define PORT_OUTSET_OUT7SET(value)            (PORT_OUTSET_OUT7SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT7SET_Pos)) /* Assignment of value for OUT7SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT8SET_Pos               _UINT32_(8)                                          /* (PORT_OUTSET) PORT Data Output Value 8 Set Position */
#define PORT_OUTSET_OUT8SET_Msk               (_UINT32_(0x1) << PORT_OUTSET_OUT8SET_Pos)           /* (PORT_OUTSET) PORT Data Output Value 8 Set Mask */
#define PORT_OUTSET_OUT8SET(value)            (PORT_OUTSET_OUT8SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT8SET_Pos)) /* Assignment of value for OUT8SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT9SET_Pos               _UINT32_(9)                                          /* (PORT_OUTSET) PORT Data Output Value 9 Set Position */
#define PORT_OUTSET_OUT9SET_Msk               (_UINT32_(0x1) << PORT_OUTSET_OUT9SET_Pos)           /* (PORT_OUTSET) PORT Data Output Value 9 Set Mask */
#define PORT_OUTSET_OUT9SET(value)            (PORT_OUTSET_OUT9SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT9SET_Pos)) /* Assignment of value for OUT9SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT10SET_Pos              _UINT32_(10)                                         /* (PORT_OUTSET) PORT Data Output Value 10 Set Position */
#define PORT_OUTSET_OUT10SET_Msk              (_UINT32_(0x1) << PORT_OUTSET_OUT10SET_Pos)          /* (PORT_OUTSET) PORT Data Output Value 10 Set Mask */
#define PORT_OUTSET_OUT10SET(value)           (PORT_OUTSET_OUT10SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT10SET_Pos)) /* Assignment of value for OUT10SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT11SET_Pos              _UINT32_(11)                                         /* (PORT_OUTSET) PORT Data Output Value 11 Set Position */
#define PORT_OUTSET_OUT11SET_Msk              (_UINT32_(0x1) << PORT_OUTSET_OUT11SET_Pos)          /* (PORT_OUTSET) PORT Data Output Value 11 Set Mask */
#define PORT_OUTSET_OUT11SET(value)           (PORT_OUTSET_OUT11SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT11SET_Pos)) /* Assignment of value for OUT11SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT12SET_Pos              _UINT32_(12)                                         /* (PORT_OUTSET) PORT Data Output Value 12 Set Position */
#define PORT_OUTSET_OUT12SET_Msk              (_UINT32_(0x1) << PORT_OUTSET_OUT12SET_Pos)          /* (PORT_OUTSET) PORT Data Output Value 12 Set Mask */
#define PORT_OUTSET_OUT12SET(value)           (PORT_OUTSET_OUT12SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT12SET_Pos)) /* Assignment of value for OUT12SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT13SET_Pos              _UINT32_(13)                                         /* (PORT_OUTSET) PORT Data Output Value 13 Set Position */
#define PORT_OUTSET_OUT13SET_Msk              (_UINT32_(0x1) << PORT_OUTSET_OUT13SET_Pos)          /* (PORT_OUTSET) PORT Data Output Value 13 Set Mask */
#define PORT_OUTSET_OUT13SET(value)           (PORT_OUTSET_OUT13SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT13SET_Pos)) /* Assignment of value for OUT13SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT14SET_Pos              _UINT32_(14)                                         /* (PORT_OUTSET) PORT Data Output Value 14 Set Position */
#define PORT_OUTSET_OUT14SET_Msk              (_UINT32_(0x1) << PORT_OUTSET_OUT14SET_Pos)          /* (PORT_OUTSET) PORT Data Output Value 14 Set Mask */
#define PORT_OUTSET_OUT14SET(value)           (PORT_OUTSET_OUT14SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT14SET_Pos)) /* Assignment of value for OUT14SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT15SET_Pos              _UINT32_(15)                                         /* (PORT_OUTSET) PORT Data Output Value 15 Set Position */
#define PORT_OUTSET_OUT15SET_Msk              (_UINT32_(0x1) << PORT_OUTSET_OUT15SET_Pos)          /* (PORT_OUTSET) PORT Data Output Value 15 Set Mask */
#define PORT_OUTSET_OUT15SET(value)           (PORT_OUTSET_OUT15SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT15SET_Pos)) /* Assignment of value for OUT15SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT16SET_Pos              _UINT32_(16)                                         /* (PORT_OUTSET) PORT Data Output Value 16 Set Position */
#define PORT_OUTSET_OUT16SET_Msk              (_UINT32_(0x1) << PORT_OUTSET_OUT16SET_Pos)          /* (PORT_OUTSET) PORT Data Output Value 16 Set Mask */
#define PORT_OUTSET_OUT16SET(value)           (PORT_OUTSET_OUT16SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT16SET_Pos)) /* Assignment of value for OUT16SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT17SET_Pos              _UINT32_(17)                                         /* (PORT_OUTSET) PORT Data Output Value 17 Set Position */
#define PORT_OUTSET_OUT17SET_Msk              (_UINT32_(0x1) << PORT_OUTSET_OUT17SET_Pos)          /* (PORT_OUTSET) PORT Data Output Value 17 Set Mask */
#define PORT_OUTSET_OUT17SET(value)           (PORT_OUTSET_OUT17SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT17SET_Pos)) /* Assignment of value for OUT17SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT18SET_Pos              _UINT32_(18)                                         /* (PORT_OUTSET) PORT Data Output Value 18 Set Position */
#define PORT_OUTSET_OUT18SET_Msk              (_UINT32_(0x1) << PORT_OUTSET_OUT18SET_Pos)          /* (PORT_OUTSET) PORT Data Output Value 18 Set Mask */
#define PORT_OUTSET_OUT18SET(value)           (PORT_OUTSET_OUT18SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT18SET_Pos)) /* Assignment of value for OUT18SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT19SET_Pos              _UINT32_(19)                                         /* (PORT_OUTSET) PORT Data Output Value 19 Set Position */
#define PORT_OUTSET_OUT19SET_Msk              (_UINT32_(0x1) << PORT_OUTSET_OUT19SET_Pos)          /* (PORT_OUTSET) PORT Data Output Value 19 Set Mask */
#define PORT_OUTSET_OUT19SET(value)           (PORT_OUTSET_OUT19SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT19SET_Pos)) /* Assignment of value for OUT19SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT20SET_Pos              _UINT32_(20)                                         /* (PORT_OUTSET) PORT Data Output Value 20 Set Position */
#define PORT_OUTSET_OUT20SET_Msk              (_UINT32_(0x1) << PORT_OUTSET_OUT20SET_Pos)          /* (PORT_OUTSET) PORT Data Output Value 20 Set Mask */
#define PORT_OUTSET_OUT20SET(value)           (PORT_OUTSET_OUT20SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT20SET_Pos)) /* Assignment of value for OUT20SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT21SET_Pos              _UINT32_(21)                                         /* (PORT_OUTSET) PORT Data Output Value 21 Set Position */
#define PORT_OUTSET_OUT21SET_Msk              (_UINT32_(0x1) << PORT_OUTSET_OUT21SET_Pos)          /* (PORT_OUTSET) PORT Data Output Value 21 Set Mask */
#define PORT_OUTSET_OUT21SET(value)           (PORT_OUTSET_OUT21SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT21SET_Pos)) /* Assignment of value for OUT21SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT22SET_Pos              _UINT32_(22)                                         /* (PORT_OUTSET) PORT Data Output Value 22 Set Position */
#define PORT_OUTSET_OUT22SET_Msk              (_UINT32_(0x1) << PORT_OUTSET_OUT22SET_Pos)          /* (PORT_OUTSET) PORT Data Output Value 22 Set Mask */
#define PORT_OUTSET_OUT22SET(value)           (PORT_OUTSET_OUT22SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT22SET_Pos)) /* Assignment of value for OUT22SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT23SET_Pos              _UINT32_(23)                                         /* (PORT_OUTSET) PORT Data Output Value 23 Set Position */
#define PORT_OUTSET_OUT23SET_Msk              (_UINT32_(0x1) << PORT_OUTSET_OUT23SET_Pos)          /* (PORT_OUTSET) PORT Data Output Value 23 Set Mask */
#define PORT_OUTSET_OUT23SET(value)           (PORT_OUTSET_OUT23SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT23SET_Pos)) /* Assignment of value for OUT23SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT24SET_Pos              _UINT32_(24)                                         /* (PORT_OUTSET) PORT Data Output Value 24 Set Position */
#define PORT_OUTSET_OUT24SET_Msk              (_UINT32_(0x1) << PORT_OUTSET_OUT24SET_Pos)          /* (PORT_OUTSET) PORT Data Output Value 24 Set Mask */
#define PORT_OUTSET_OUT24SET(value)           (PORT_OUTSET_OUT24SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT24SET_Pos)) /* Assignment of value for OUT24SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT25SET_Pos              _UINT32_(25)                                         /* (PORT_OUTSET) PORT Data Output Value 25 Set Position */
#define PORT_OUTSET_OUT25SET_Msk              (_UINT32_(0x1) << PORT_OUTSET_OUT25SET_Pos)          /* (PORT_OUTSET) PORT Data Output Value 25 Set Mask */
#define PORT_OUTSET_OUT25SET(value)           (PORT_OUTSET_OUT25SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT25SET_Pos)) /* Assignment of value for OUT25SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT26SET_Pos              _UINT32_(26)                                         /* (PORT_OUTSET) PORT Data Output Value 26 Set Position */
#define PORT_OUTSET_OUT26SET_Msk              (_UINT32_(0x1) << PORT_OUTSET_OUT26SET_Pos)          /* (PORT_OUTSET) PORT Data Output Value 26 Set Mask */
#define PORT_OUTSET_OUT26SET(value)           (PORT_OUTSET_OUT26SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT26SET_Pos)) /* Assignment of value for OUT26SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT27SET_Pos              _UINT32_(27)                                         /* (PORT_OUTSET) PORT Data Output Value 27 Set Position */
#define PORT_OUTSET_OUT27SET_Msk              (_UINT32_(0x1) << PORT_OUTSET_OUT27SET_Pos)          /* (PORT_OUTSET) PORT Data Output Value 27 Set Mask */
#define PORT_OUTSET_OUT27SET(value)           (PORT_OUTSET_OUT27SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT27SET_Pos)) /* Assignment of value for OUT27SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT28SET_Pos              _UINT32_(28)                                         /* (PORT_OUTSET) PORT Data Output Value 28 Set Position */
#define PORT_OUTSET_OUT28SET_Msk              (_UINT32_(0x1) << PORT_OUTSET_OUT28SET_Pos)          /* (PORT_OUTSET) PORT Data Output Value 28 Set Mask */
#define PORT_OUTSET_OUT28SET(value)           (PORT_OUTSET_OUT28SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT28SET_Pos)) /* Assignment of value for OUT28SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT29SET_Pos              _UINT32_(29)                                         /* (PORT_OUTSET) PORT Data Output Value 29 Set Position */
#define PORT_OUTSET_OUT29SET_Msk              (_UINT32_(0x1) << PORT_OUTSET_OUT29SET_Pos)          /* (PORT_OUTSET) PORT Data Output Value 29 Set Mask */
#define PORT_OUTSET_OUT29SET(value)           (PORT_OUTSET_OUT29SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT29SET_Pos)) /* Assignment of value for OUT29SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT30SET_Pos              _UINT32_(30)                                         /* (PORT_OUTSET) PORT Data Output Value 30 Set Position */
#define PORT_OUTSET_OUT30SET_Msk              (_UINT32_(0x1) << PORT_OUTSET_OUT30SET_Pos)          /* (PORT_OUTSET) PORT Data Output Value 30 Set Mask */
#define PORT_OUTSET_OUT30SET(value)           (PORT_OUTSET_OUT30SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT30SET_Pos)) /* Assignment of value for OUT30SET in the PORT_OUTSET register */
#define PORT_OUTSET_OUT31SET_Pos              _UINT32_(31)                                         /* (PORT_OUTSET) PORT Data Output Value 31 Set Position */
#define PORT_OUTSET_OUT31SET_Msk              (_UINT32_(0x1) << PORT_OUTSET_OUT31SET_Pos)          /* (PORT_OUTSET) PORT Data Output Value 31 Set Mask */
#define PORT_OUTSET_OUT31SET(value)           (PORT_OUTSET_OUT31SET_Msk & (_UINT32_(value) << PORT_OUTSET_OUT31SET_Pos)) /* Assignment of value for OUT31SET in the PORT_OUTSET register */
#define PORT_OUTSET_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (PORT_OUTSET) Register Mask  */


/* -------- PORT_OUTTGL : (PORT Offset: 0x1C) (R/W 32) Data Output Value Toggle -------- */
#define PORT_OUTTGL_RESETVALUE                _UINT32_(0x00)                                       /*  (PORT_OUTTGL) Data Output Value Toggle  Reset Value */

