vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/port.h
#define PORT_OUTTGL_OUT0TGL_Pos               _UINT32_(0)                                          /* (PORT_OUTTGL) PORT Data Output Value 0 Toggle Position */
#define PORT_OUTTGL_OUT0TGL_Msk               (_UINT32_(0x1) << PORT_OUTTGL_OUT0TGL_Pos)           /* (PORT_OUTTGL) PORT Data Output Value 0 Toggle Mask */
#define PORT_OUTTGL_OUT0TGL(value)            (PORT_OUTTGL_OUT0TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT0TGL_Pos)) /* Assignment of value for OUT0TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT1TGL_Pos               _UINT32_(1)                                          /* (PORT_OUTTGL) PORT Data Output Value 1 Toggle Position */
#define PORT_OUTTGL_OUT1TGL_Msk               (_UINT32_(0x1) << PORT_OUTTGL_OUT1TGL_Pos)           /* (PORT_OUTTGL) PORT Data Output Value 1 Toggle Mask */
#define PORT_OUTTGL_OUT1TGL(value)            (PORT_OUTTGL_OUT1TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT1TGL_Pos)) /* Assignment of value for OUT1TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT2TGL_Pos               _UINT32_(2)                                          /* (PORT_OUTTGL) PORT Data Output Value 2 Toggle Position */
#define PORT_OUTTGL_OUT2TGL_Msk               (_UINT32_(0x1) << PORT_OUTTGL_OUT2TGL_Pos)           /* (PORT_OUTTGL) PORT Data Output Value 2 Toggle Mask */
#define PORT_OUTTGL_OUT2TGL(value)            (PORT_OUTTGL_OUT2TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT2TGL_Pos)) /* Assignment of value for OUT2TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT3TGL_Pos               _UINT32_(3)                                          /* (PORT_OUTTGL) PORT Data Output Value 3 Toggle Position */
#define PORT_OUTTGL_OUT3TGL_Msk               (_UINT32_(0x1) << PORT_OUTTGL_OUT3TGL_Pos)           /* (PORT_OUTTGL) PORT Data Output Value 3 Toggle Mask */
#define PORT_OUTTGL_OUT3TGL(value)            (PORT_OUTTGL_OUT3TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT3TGL_Pos)) /* Assignment of value for OUT3TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT4TGL_Pos               _UINT32_(4)                                          /* (PORT_OUTTGL) PORT Data Output Value 4 Toggle Position */
#define PORT_OUTTGL_OUT4TGL_Msk               (_UINT32_(0x1) << PORT_OUTTGL_OUT4TGL_Pos)           /* (PORT_OUTTGL) PORT Data Output Value 4 Toggle Mask */
#define PORT_OUTTGL_OUT4TGL(value)            (PORT_OUTTGL_OUT4TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT4TGL_Pos)) /* Assignment of value for OUT4TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT5TGL_Pos               _UINT32_(5)                                          /* (PORT_OUTTGL) PORT Data Output Value 5 Toggle Position */
#define PORT_OUTTGL_OUT5TGL_Msk               (_UINT32_(0x1) << PORT_OUTTGL_OUT5TGL_Pos)           /* (PORT_OUTTGL) PORT Data Output Value 5 Toggle Mask */
#define PORT_OUTTGL_OUT5TGL(value)            (PORT_OUTTGL_OUT5TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT5TGL_Pos)) /* Assignment of value for OUT5TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT6TGL_Pos               _UINT32_(6)                                          /* (PORT_OUTTGL) PORT Data Output Value 6 Toggle Position */
#define PORT_OUTTGL_OUT6TGL_Msk               (_UINT32_(0x1) << PORT_OUTTGL_OUT6TGL_Pos)           /* (PORT_OUTTGL) PORT Data Output Value 6 Toggle Mask */
#define PORT_OUTTGL_OUT6TGL(value)            (PORT_OUTTGL_OUT6TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT6TGL_Pos)) /* Assignment of value for OUT6TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT7TGL_Pos               _UINT32_(7)                                          /* (PORT_OUTTGL) PORT Data Output Value 7 Toggle Position */
#define PORT_OUTTGL_OUT7TGL_Msk               (_UINT32_(0x1) << PORT_OUTTGL_OUT7TGL_Pos)           /* (PORT_OUTTGL) PORT Data Output Value 7 Toggle Mask */
#define PORT_OUTTGL_OUT7TGL(value)            (PORT_OUTTGL_OUT7TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT7TGL_Pos)) /* Assignment of value for OUT7TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT8TGL_Pos               _UINT32_(8)                                          /* (PORT_OUTTGL) PORT Data Output Value 8 Toggle Position */
#define PORT_OUTTGL_OUT8TGL_Msk               (_UINT32_(0x1) << PORT_OUTTGL_OUT8TGL_Pos)           /* (PORT_OUTTGL) PORT Data Output Value 8 Toggle Mask */
#define PORT_OUTTGL_OUT8TGL(value)            (PORT_OUTTGL_OUT8TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT8TGL_Pos)) /* Assignment of value for OUT8TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT9TGL_Pos               _UINT32_(9)                                          /* (PORT_OUTTGL) PORT Data Output Value 9 Toggle Position */
#define PORT_OUTTGL_OUT9TGL_Msk               (_UINT32_(0x1) << PORT_OUTTGL_OUT9TGL_Pos)           /* (PORT_OUTTGL) PORT Data Output Value 9 Toggle Mask */
#define PORT_OUTTGL_OUT9TGL(value)            (PORT_OUTTGL_OUT9TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT9TGL_Pos)) /* Assignment of value for OUT9TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT10TGL_Pos              _UINT32_(10)                                         /* (PORT_OUTTGL) PORT Data Output Value 10 Toggle Position */
#define PORT_OUTTGL_OUT10TGL_Msk              (_UINT32_(0x1) << PORT_OUTTGL_OUT10TGL_Pos)          /* (PORT_OUTTGL) PORT Data Output Value 10 Toggle Mask */
#define PORT_OUTTGL_OUT10TGL(value)           (PORT_OUTTGL_OUT10TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT10TGL_Pos)) /* Assignment of value for OUT10TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT11TGL_Pos              _UINT32_(11)                                         /* (PORT_OUTTGL) PORT Data Output Value 11 Toggle Position */
#define PORT_OUTTGL_OUT11TGL_Msk              (_UINT32_(0x1) << PORT_OUTTGL_OUT11TGL_Pos)          /* (PORT_OUTTGL) PORT Data Output Value 11 Toggle Mask */
#define PORT_OUTTGL_OUT11TGL(value)           (PORT_OUTTGL_OUT11TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT11TGL_Pos)) /* Assignment of value for OUT11TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT12TGL_Pos              _UINT32_(12)                                         /* (PORT_OUTTGL) PORT Data Output Value 12 Toggle Position */
#define PORT_OUTTGL_OUT12TGL_Msk              (_UINT32_(0x1) << PORT_OUTTGL_OUT12TGL_Pos)          /* (PORT_OUTTGL) PORT Data Output Value 12 Toggle Mask */
#define PORT_OUTTGL_OUT12TGL(value)           (PORT_OUTTGL_OUT12TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT12TGL_Pos)) /* Assignment of value for OUT12TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT13TGL_Pos              _UINT32_(13)                                         /* (PORT_OUTTGL) PORT Data Output Value 13 Toggle Position */
#define PORT_OUTTGL_OUT13TGL_Msk              (_UINT32_(0x1) << PORT_OUTTGL_OUT13TGL_Pos)          /* (PORT_OUTTGL) PORT Data Output Value 13 Toggle Mask */
#define PORT_OUTTGL_OUT13TGL(value)           (PORT_OUTTGL_OUT13TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT13TGL_Pos)) /* Assignment of value for OUT13TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT14TGL_Pos              _UINT32_(14)                                         /* (PORT_OUTTGL) PORT Data Output Value 14 Toggle Position */
#define PORT_OUTTGL_OUT14TGL_Msk              (_UINT32_(0x1) << PORT_OUTTGL_OUT14TGL_Pos)          /* (PORT_OUTTGL) PORT Data Output Value 14 Toggle Mask */
#define PORT_OUTTGL_OUT14TGL(value)           (PORT_OUTTGL_OUT14TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT14TGL_Pos)) /* Assignment of value for OUT14TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT15TGL_Pos              _UINT32_(15)                                         /* (PORT_OUTTGL) PORT Data Output Value 15 Toggle Position */
#define PORT_OUTTGL_OUT15TGL_Msk              (_UINT32_(0x1) << PORT_OUTTGL_OUT15TGL_Pos)          /* (PORT_OUTTGL) PORT Data Output Value 15 Toggle Mask */
#define PORT_OUTTGL_OUT15TGL(value)           (PORT_OUTTGL_OUT15TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT15TGL_Pos)) /* Assignment of value for OUT15TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT16TGL_Pos              _UINT32_(16)                                         /* (PORT_OUTTGL) PORT Data Output Value 16 Toggle Position */
#define PORT_OUTTGL_OUT16TGL_Msk              (_UINT32_(0x1) << PORT_OUTTGL_OUT16TGL_Pos)          /* (PORT_OUTTGL) PORT Data Output Value 16 Toggle Mask */
#define PORT_OUTTGL_OUT16TGL(value)           (PORT_OUTTGL_OUT16TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT16TGL_Pos)) /* Assignment of value for OUT16TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT17TGL_Pos              _UINT32_(17)                                         /* (PORT_OUTTGL) PORT Data Output Value 17 Toggle Position */
#define PORT_OUTTGL_OUT17TGL_Msk              (_UINT32_(0x1) << PORT_OUTTGL_OUT17TGL_Pos)          /* (PORT_OUTTGL) PORT Data Output Value 17 Toggle Mask */
#define PORT_OUTTGL_OUT17TGL(value)           (PORT_OUTTGL_OUT17TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT17TGL_Pos)) /* Assignment of value for OUT17TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT18TGL_Pos              _UINT32_(18)                                         /* (PORT_OUTTGL) PORT Data Output Value 18 Toggle Position */
#define PORT_OUTTGL_OUT18TGL_Msk              (_UINT32_(0x1) << PORT_OUTTGL_OUT18TGL_Pos)          /* (PORT_OUTTGL) PORT Data Output Value 18 Toggle Mask */
#define PORT_OUTTGL_OUT18TGL(value)           (PORT_OUTTGL_OUT18TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT18TGL_Pos)) /* Assignment of value for OUT18TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT19TGL_Pos              _UINT32_(19)                                         /* (PORT_OUTTGL) PORT Data Output Value 19 Toggle Position */
#define PORT_OUTTGL_OUT19TGL_Msk              (_UINT32_(0x1) << PORT_OUTTGL_OUT19TGL_Pos)          /* (PORT_OUTTGL) PORT Data Output Value 19 Toggle Mask */
#define PORT_OUTTGL_OUT19TGL(value)           (PORT_OUTTGL_OUT19TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT19TGL_Pos)) /* Assignment of value for OUT19TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT20TGL_Pos              _UINT32_(20)                                         /* (PORT_OUTTGL) PORT Data Output Value 20 Toggle Position */
#define PORT_OUTTGL_OUT20TGL_Msk              (_UINT32_(0x1) << PORT_OUTTGL_OUT20TGL_Pos)          /* (PORT_OUTTGL) PORT Data Output Value 20 Toggle Mask */
#define PORT_OUTTGL_OUT20TGL(value)           (PORT_OUTTGL_OUT20TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT20TGL_Pos)) /* Assignment of value for OUT20TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT21TGL_Pos              _UINT32_(21)                                         /* (PORT_OUTTGL) PORT Data Output Value 21 Toggle Position */
#define PORT_OUTTGL_OUT21TGL_Msk              (_UINT32_(0x1) << PORT_OUTTGL_OUT21TGL_Pos)          /* (PORT_OUTTGL) PORT Data Output Value 21 Toggle Mask */
#define PORT_OUTTGL_OUT21TGL(value)           (PORT_OUTTGL_OUT21TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT21TGL_Pos)) /* Assignment of value for OUT21TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT22TGL_Pos              _UINT32_(22)                                         /* (PORT_OUTTGL) PORT Data Output Value 22 Toggle Position */
#define PORT_OUTTGL_OUT22TGL_Msk              (_UINT32_(0x1) << PORT_OUTTGL_OUT22TGL_Pos)          /* (PORT_OUTTGL) PORT Data Output Value 22 Toggle Mask */
#define PORT_OUTTGL_OUT22TGL(value)           (PORT_OUTTGL_OUT22TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT22TGL_Pos)) /* Assignment of value for OUT22TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT23TGL_Pos              _UINT32_(23)                                         /* (PORT_OUTTGL) PORT Data Output Value 23 Toggle Position */
#define PORT_OUTTGL_OUT23TGL_Msk              (_UINT32_(0x1) << PORT_OUTTGL_OUT23TGL_Pos)          /* (PORT_OUTTGL) PORT Data Output Value 23 Toggle Mask */
#define PORT_OUTTGL_OUT23TGL(value)           (PORT_OUTTGL_OUT23TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT23TGL_Pos)) /* Assignment of value for OUT23TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT24TGL_Pos              _UINT32_(24)                                         /* (PORT_OUTTGL) PORT Data Output Value 24 Toggle Position */
#define PORT_OUTTGL_OUT24TGL_Msk              (_UINT32_(0x1) << PORT_OUTTGL_OUT24TGL_Pos)          /* (PORT_OUTTGL) PORT Data Output Value 24 Toggle Mask */
#define PORT_OUTTGL_OUT24TGL(value)           (PORT_OUTTGL_OUT24TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT24TGL_Pos)) /* Assignment of value for OUT24TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT25TGL_Pos              _UINT32_(25)                                         /* (PORT_OUTTGL) PORT Data Output Value 25 Toggle Position */
#define PORT_OUTTGL_OUT25TGL_Msk              (_UINT32_(0x1) << PORT_OUTTGL_OUT25TGL_Pos)          /* (PORT_OUTTGL) PORT Data Output Value 25 Toggle Mask */
#define PORT_OUTTGL_OUT25TGL(value)           (PORT_OUTTGL_OUT25TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT25TGL_Pos)) /* Assignment of value for OUT25TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT26TGL_Pos              _UINT32_(26)                                         /* (PORT_OUTTGL) PORT Data Output Value 26 Toggle Position */
#define PORT_OUTTGL_OUT26TGL_Msk              (_UINT32_(0x1) << PORT_OUTTGL_OUT26TGL_Pos)          /* (PORT_OUTTGL) PORT Data Output Value 26 Toggle Mask */
#define PORT_OUTTGL_OUT26TGL(value)           (PORT_OUTTGL_OUT26TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT26TGL_Pos)) /* Assignment of value for OUT26TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT27TGL_Pos              _UINT32_(27)                                         /* (PORT_OUTTGL) PORT Data Output Value 27 Toggle Position */
#define PORT_OUTTGL_OUT27TGL_Msk              (_UINT32_(0x1) << PORT_OUTTGL_OUT27TGL_Pos)          /* (PORT_OUTTGL) PORT Data Output Value 27 Toggle Mask */
#define PORT_OUTTGL_OUT27TGL(value)           (PORT_OUTTGL_OUT27TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT27TGL_Pos)) /* Assignment of value for OUT27TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT28TGL_Pos              _UINT32_(28)                                         /* (PORT_OUTTGL) PORT Data Output Value 28 Toggle Position */
#define PORT_OUTTGL_OUT28TGL_Msk              (_UINT32_(0x1) << PORT_OUTTGL_OUT28TGL_Pos)          /* (PORT_OUTTGL) PORT Data Output Value 28 Toggle Mask */
#define PORT_OUTTGL_OUT28TGL(value)           (PORT_OUTTGL_OUT28TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT28TGL_Pos)) /* Assignment of value for OUT28TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT29TGL_Pos              _UINT32_(29)                                         /* (PORT_OUTTGL) PORT Data Output Value 29 Toggle Position */
#define PORT_OUTTGL_OUT29TGL_Msk              (_UINT32_(0x1) << PORT_OUTTGL_OUT29TGL_Pos)          /* (PORT_OUTTGL) PORT Data Output Value 29 Toggle Mask */
#define PORT_OUTTGL_OUT29TGL(value)           (PORT_OUTTGL_OUT29TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT29TGL_Pos)) /* Assignment of value for OUT29TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT30TGL_Pos              _UINT32_(30)                                         /* (PORT_OUTTGL) PORT Data Output Value 30 Toggle Position */
#define PORT_OUTTGL_OUT30TGL_Msk              (_UINT32_(0x1) << PORT_OUTTGL_OUT30TGL_Pos)          /* (PORT_OUTTGL) PORT Data Output Value 30 Toggle Mask */
#define PORT_OUTTGL_OUT30TGL(value)           (PORT_OUTTGL_OUT30TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT30TGL_Pos)) /* Assignment of value for OUT30TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_OUT31TGL_Pos              _UINT32_(31)                                         /* (PORT_OUTTGL) PORT Data Output Value 31 Toggle Position */
#define PORT_OUTTGL_OUT31TGL_Msk              (_UINT32_(0x1) << PORT_OUTTGL_OUT31TGL_Pos)          /* (PORT_OUTTGL) PORT Data Output Value 31 Toggle Mask */
#define PORT_OUTTGL_OUT31TGL(value)           (PORT_OUTTGL_OUT31TGL_Msk & (_UINT32_(value) << PORT_OUTTGL_OUT31TGL_Pos)) /* Assignment of value for OUT31TGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (PORT_OUTTGL) Register Mask  */


/* -------- PORT_IN : (PORT Offset: 0x20) ( R/ 32) Data Input Value -------- */
#define PORT_IN_RESETVALUE                    _UINT32_(0x00)                                       /*  (PORT_IN) Data Input Value  Reset Value */

