vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/port.h
#define PORT_EVCTRL_PID0_Pos                  _UINT32_(0)                                          /* (PORT_EVCTRL) Event 0 Pin Identifier Position */
#define PORT_EVCTRL_PID0_Msk                  (_UINT32_(0x1F) << PORT_EVCTRL_PID0_Pos)             /* (PORT_EVCTRL) Event 0 Pin Identifier Mask */
#define PORT_EVCTRL_PID0(value)               (PORT_EVCTRL_PID0_Msk & (_UINT32_(value) << PORT_EVCTRL_PID0_Pos)) /* Assignment of value for PID0 in the PORT_EVCTRL register */
#define   PORT_EVCTRL_PID0_PIN0_Val           _UINT32_(0x0)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 0  */
#define   PORT_EVCTRL_PID0_PIN1_Val           _UINT32_(0x1)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 1  */
#define   PORT_EVCTRL_PID0_PIN2_Val           _UINT32_(0x2)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 2  */
#define   PORT_EVCTRL_PID0_PIN3_Val           _UINT32_(0x3)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 3  */
#define   PORT_EVCTRL_PID0_PIN4_Val           _UINT32_(0x4)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 4  */
#define   PORT_EVCTRL_PID0_PIN5_Val           _UINT32_(0x5)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 5  */
#define   PORT_EVCTRL_PID0_PIN6_Val           _UINT32_(0x6)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 6  */
#define   PORT_EVCTRL_PID0_PIN7_Val           _UINT32_(0x7)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 7  */
#define   PORT_EVCTRL_PID0_PIN8_Val           _UINT32_(0x8)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 8  */
#define   PORT_EVCTRL_PID0_PIN9_Val           _UINT32_(0x9)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 9  */
#define   PORT_EVCTRL_PID0_PIN10_Val          _UINT32_(0xA)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 10  */
#define   PORT_EVCTRL_PID0_PIN11_Val          _UINT32_(0xB)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 11  */
#define   PORT_EVCTRL_PID0_PIN12_Val          _UINT32_(0xC)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 12  */
#define   PORT_EVCTRL_PID0_PIN13_Val          _UINT32_(0xD)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 13  */
#define   PORT_EVCTRL_PID0_PIN14_Val          _UINT32_(0xE)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 14  */
#define   PORT_EVCTRL_PID0_PIN15_Val          _UINT32_(0xF)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 15  */
#define   PORT_EVCTRL_PID0_PIN16_Val          _UINT32_(0x10)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 16  */
#define   PORT_EVCTRL_PID0_PIN17_Val          _UINT32_(0x11)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 17  */
#define   PORT_EVCTRL_PID0_PIN18_Val          _UINT32_(0x12)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 18  */
#define   PORT_EVCTRL_PID0_PIN19_Val          _UINT32_(0x13)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 19  */
#define   PORT_EVCTRL_PID0_PIN20_Val          _UINT32_(0x14)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 20  */
#define   PORT_EVCTRL_PID0_PIN21_Val          _UINT32_(0x15)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 21  */
#define   PORT_EVCTRL_PID0_PIN22_Val          _UINT32_(0x16)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 22  */
#define   PORT_EVCTRL_PID0_PIN23_Val          _UINT32_(0x17)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 23  */
#define   PORT_EVCTRL_PID0_PIN24_Val          _UINT32_(0x18)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 24  */
#define   PORT_EVCTRL_PID0_PIN25_Val          _UINT32_(0x19)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 25  */
#define   PORT_EVCTRL_PID0_PIN26_Val          _UINT32_(0x1A)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 26  */
#define   PORT_EVCTRL_PID0_PIN27_Val          _UINT32_(0x1B)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 27  */
#define   PORT_EVCTRL_PID0_PIN28_Val          _UINT32_(0x1C)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 28  */
#define   PORT_EVCTRL_PID0_PIN29_Val          _UINT32_(0x1D)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 29  */
#define   PORT_EVCTRL_PID0_PIN30_Val          _UINT32_(0x1E)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 30  */
#define   PORT_EVCTRL_PID0_PIN31_Val          _UINT32_(0x1F)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 31  */
#define PORT_EVCTRL_PID0_PIN0                 (PORT_EVCTRL_PID0_PIN0_Val << PORT_EVCTRL_PID0_Pos)  /* (PORT_EVCTRL) Event actions will be executed on pin 0 Position */
#define PORT_EVCTRL_PID0_PIN1                 (PORT_EVCTRL_PID0_PIN1_Val << PORT_EVCTRL_PID0_Pos)  /* (PORT_EVCTRL) Event actions will be executed on pin 1 Position */
#define PORT_EVCTRL_PID0_PIN2                 (PORT_EVCTRL_PID0_PIN2_Val << PORT_EVCTRL_PID0_Pos)  /* (PORT_EVCTRL) Event actions will be executed on pin 2 Position */
#define PORT_EVCTRL_PID0_PIN3                 (PORT_EVCTRL_PID0_PIN3_Val << PORT_EVCTRL_PID0_Pos)  /* (PORT_EVCTRL) Event actions will be executed on pin 3 Position */
#define PORT_EVCTRL_PID0_PIN4                 (PORT_EVCTRL_PID0_PIN4_Val << PORT_EVCTRL_PID0_Pos)  /* (PORT_EVCTRL) Event actions will be executed on pin 4 Position */
#define PORT_EVCTRL_PID0_PIN5                 (PORT_EVCTRL_PID0_PIN5_Val << PORT_EVCTRL_PID0_Pos)  /* (PORT_EVCTRL) Event actions will be executed on pin 5 Position */
#define PORT_EVCTRL_PID0_PIN6                 (PORT_EVCTRL_PID0_PIN6_Val << PORT_EVCTRL_PID0_Pos)  /* (PORT_EVCTRL) Event actions will be executed on pin 6 Position */
#define PORT_EVCTRL_PID0_PIN7                 (PORT_EVCTRL_PID0_PIN7_Val << PORT_EVCTRL_PID0_Pos)  /* (PORT_EVCTRL) Event actions will be executed on pin 7 Position */
#define PORT_EVCTRL_PID0_PIN8                 (PORT_EVCTRL_PID0_PIN8_Val << PORT_EVCTRL_PID0_Pos)  /* (PORT_EVCTRL) Event actions will be executed on pin 8 Position */
#define PORT_EVCTRL_PID0_PIN9                 (PORT_EVCTRL_PID0_PIN9_Val << PORT_EVCTRL_PID0_Pos)  /* (PORT_EVCTRL) Event actions will be executed on pin 9 Position */
#define PORT_EVCTRL_PID0_PIN10                (PORT_EVCTRL_PID0_PIN10_Val << PORT_EVCTRL_PID0_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 10 Position */
#define PORT_EVCTRL_PID0_PIN11                (PORT_EVCTRL_PID0_PIN11_Val << PORT_EVCTRL_PID0_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 11 Position */
#define PORT_EVCTRL_PID0_PIN12                (PORT_EVCTRL_PID0_PIN12_Val << PORT_EVCTRL_PID0_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 12 Position */
#define PORT_EVCTRL_PID0_PIN13                (PORT_EVCTRL_PID0_PIN13_Val << PORT_EVCTRL_PID0_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 13 Position */
#define PORT_EVCTRL_PID0_PIN14                (PORT_EVCTRL_PID0_PIN14_Val << PORT_EVCTRL_PID0_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 14 Position */
#define PORT_EVCTRL_PID0_PIN15                (PORT_EVCTRL_PID0_PIN15_Val << PORT_EVCTRL_PID0_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 15 Position */
#define PORT_EVCTRL_PID0_PIN16                (PORT_EVCTRL_PID0_PIN16_Val << PORT_EVCTRL_PID0_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 16 Position */
#define PORT_EVCTRL_PID0_PIN17                (PORT_EVCTRL_PID0_PIN17_Val << PORT_EVCTRL_PID0_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 17 Position */
#define PORT_EVCTRL_PID0_PIN18                (PORT_EVCTRL_PID0_PIN18_Val << PORT_EVCTRL_PID0_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 18 Position */
#define PORT_EVCTRL_PID0_PIN19                (PORT_EVCTRL_PID0_PIN19_Val << PORT_EVCTRL_PID0_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 19 Position */
#define PORT_EVCTRL_PID0_PIN20                (PORT_EVCTRL_PID0_PIN20_Val << PORT_EVCTRL_PID0_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 20 Position */
#define PORT_EVCTRL_PID0_PIN21                (PORT_EVCTRL_PID0_PIN21_Val << PORT_EVCTRL_PID0_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 21 Position */
#define PORT_EVCTRL_PID0_PIN22                (PORT_EVCTRL_PID0_PIN22_Val << PORT_EVCTRL_PID0_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 22 Position */
#define PORT_EVCTRL_PID0_PIN23                (PORT_EVCTRL_PID0_PIN23_Val << PORT_EVCTRL_PID0_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 23 Position */
#define PORT_EVCTRL_PID0_PIN24                (PORT_EVCTRL_PID0_PIN24_Val << PORT_EVCTRL_PID0_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 24 Position */
#define PORT_EVCTRL_PID0_PIN25                (PORT_EVCTRL_PID0_PIN25_Val << PORT_EVCTRL_PID0_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 25 Position */
#define PORT_EVCTRL_PID0_PIN26                (PORT_EVCTRL_PID0_PIN26_Val << PORT_EVCTRL_PID0_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 26 Position */
#define PORT_EVCTRL_PID0_PIN27                (PORT_EVCTRL_PID0_PIN27_Val << PORT_EVCTRL_PID0_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 27 Position */
#define PORT_EVCTRL_PID0_PIN28                (PORT_EVCTRL_PID0_PIN28_Val << PORT_EVCTRL_PID0_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 28 Position */
#define PORT_EVCTRL_PID0_PIN29                (PORT_EVCTRL_PID0_PIN29_Val << PORT_EVCTRL_PID0_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 29 Position */
#define PORT_EVCTRL_PID0_PIN30                (PORT_EVCTRL_PID0_PIN30_Val << PORT_EVCTRL_PID0_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 30 Position */
#define PORT_EVCTRL_PID0_PIN31                (PORT_EVCTRL_PID0_PIN31_Val << PORT_EVCTRL_PID0_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 31 Position */
#define PORT_EVCTRL_EVACT0_Pos                _UINT32_(5)                                          /* (PORT_EVCTRL) Event 0 Action Position */
#define PORT_EVCTRL_EVACT0_Msk                (_UINT32_(0x3) << PORT_EVCTRL_EVACT0_Pos)            /* (PORT_EVCTRL) Event 0 Action Mask */
#define PORT_EVCTRL_EVACT0(value)             (PORT_EVCTRL_EVACT0_Msk & (_UINT32_(value) << PORT_EVCTRL_EVACT0_Pos)) /* Assignment of value for EVACT0 in the PORT_EVCTRL register */
#define   PORT_EVCTRL_EVACT0_OUT_Val          _UINT32_(0x0)                                        /* (PORT_EVCTRL) The output value of pin PIDn will be set to the level of the event  */
#define   PORT_EVCTRL_EVACT0_SET_Val          _UINT32_(0x1)                                        /* (PORT_EVCTRL) Set the output value of pin PIDn on the rising edge of the event  */
#define   PORT_EVCTRL_EVACT0_CLR_Val          _UINT32_(0x2)                                        /* (PORT_EVCTRL) Clear the output value of pin PIDn on the rising edge of the event  */
#define   PORT_EVCTRL_EVACT0_TGL_Val          _UINT32_(0x3)                                        /* (PORT_EVCTRL) Toggle the output value of pin PIDn on the rising edge of the event  */
#define PORT_EVCTRL_EVACT0_OUT                (PORT_EVCTRL_EVACT0_OUT_Val << PORT_EVCTRL_EVACT0_Pos) /* (PORT_EVCTRL) The output value of pin PIDn will be set to the level of the event Position */
#define PORT_EVCTRL_EVACT0_SET                (PORT_EVCTRL_EVACT0_SET_Val << PORT_EVCTRL_EVACT0_Pos) /* (PORT_EVCTRL) Set the output value of pin PIDn on the rising edge of the event Position */
#define PORT_EVCTRL_EVACT0_CLR                (PORT_EVCTRL_EVACT0_CLR_Val << PORT_EVCTRL_EVACT0_Pos) /* (PORT_EVCTRL) Clear the output value of pin PIDn on the rising edge of the event Position */
#define PORT_EVCTRL_EVACT0_TGL                (PORT_EVCTRL_EVACT0_TGL_Val << PORT_EVCTRL_EVACT0_Pos) /* (PORT_EVCTRL) Toggle the output value of pin PIDn on the rising edge of the event Position */
#define PORT_EVCTRL_PORTEI0_Pos               _UINT32_(7)                                          /* (PORT_EVCTRL) PORT Event 0 Input Enable Position */
#define PORT_EVCTRL_PORTEI0_Msk               (_UINT32_(0x1) << PORT_EVCTRL_PORTEI0_Pos)           /* (PORT_EVCTRL) PORT Event 0 Input Enable Mask */
#define PORT_EVCTRL_PORTEI0(value)            (PORT_EVCTRL_PORTEI0_Msk & (_UINT32_(value) << PORT_EVCTRL_PORTEI0_Pos)) /* Assignment of value for PORTEI0 in the PORT_EVCTRL register */
#define PORT_EVCTRL_PID1_Pos                  _UINT32_(8)                                          /* (PORT_EVCTRL) Event 1 Pin Identifier Position */
#define PORT_EVCTRL_PID1_Msk                  (_UINT32_(0x1F) << PORT_EVCTRL_PID1_Pos)             /* (PORT_EVCTRL) Event 1 Pin Identifier Mask */
#define PORT_EVCTRL_PID1(value)               (PORT_EVCTRL_PID1_Msk & (_UINT32_(value) << PORT_EVCTRL_PID1_Pos)) /* Assignment of value for PID1 in the PORT_EVCTRL register */
#define   PORT_EVCTRL_PID1_PIN0_Val           _UINT32_(0x0)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 0  */
#define   PORT_EVCTRL_PID1_PIN1_Val           _UINT32_(0x1)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 1  */
#define   PORT_EVCTRL_PID1_PIN2_Val           _UINT32_(0x2)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 2  */
#define   PORT_EVCTRL_PID1_PIN3_Val           _UINT32_(0x3)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 3  */
#define   PORT_EVCTRL_PID1_PIN4_Val           _UINT32_(0x4)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 4  */
#define   PORT_EVCTRL_PID1_PIN5_Val           _UINT32_(0x5)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 5  */
#define   PORT_EVCTRL_PID1_PIN6_Val           _UINT32_(0x6)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 6  */
#define   PORT_EVCTRL_PID1_PIN7_Val           _UINT32_(0x7)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 7  */
#define   PORT_EVCTRL_PID1_PIN8_Val           _UINT32_(0x8)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 8  */
#define   PORT_EVCTRL_PID1_PIN9_Val           _UINT32_(0x9)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 9  */
#define   PORT_EVCTRL_PID1_PIN10_Val          _UINT32_(0xA)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 10  */
#define   PORT_EVCTRL_PID1_PIN11_Val          _UINT32_(0xB)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 11  */
#define   PORT_EVCTRL_PID1_PIN12_Val          _UINT32_(0xC)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 12  */
#define   PORT_EVCTRL_PID1_PIN13_Val          _UINT32_(0xD)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 13  */
#define   PORT_EVCTRL_PID1_PIN14_Val          _UINT32_(0xE)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 14  */
#define   PORT_EVCTRL_PID1_PIN15_Val          _UINT32_(0xF)                                        /* (PORT_EVCTRL) Event actions will be executed on pin 15  */
#define   PORT_EVCTRL_PID1_PIN16_Val          _UINT32_(0x10)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 16  */
#define   PORT_EVCTRL_PID1_PIN17_Val          _UINT32_(0x11)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 17  */
#define   PORT_EVCTRL_PID1_PIN18_Val          _UINT32_(0x12)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 18  */
#define   PORT_EVCTRL_PID1_PIN19_Val          _UINT32_(0x13)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 19  */
#define   PORT_EVCTRL_PID1_PIN20_Val          _UINT32_(0x14)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 20  */
#define   PORT_EVCTRL_PID1_PIN21_Val          _UINT32_(0x15)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 21  */
#define   PORT_EVCTRL_PID1_PIN22_Val          _UINT32_(0x16)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 22  */
#define   PORT_EVCTRL_PID1_PIN23_Val          _UINT32_(0x17)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 23  */
#define   PORT_EVCTRL_PID1_PIN24_Val          _UINT32_(0x18)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 24  */
#define   PORT_EVCTRL_PID1_PIN25_Val          _UINT32_(0x19)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 25  */
#define   PORT_EVCTRL_PID1_PIN26_Val          _UINT32_(0x1A)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 26  */
#define   PORT_EVCTRL_PID1_PIN27_Val          _UINT32_(0x1B)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 27  */
#define   PORT_EVCTRL_PID1_PIN28_Val          _UINT32_(0x1C)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 28  */
#define   PORT_EVCTRL_PID1_PIN29_Val          _UINT32_(0x1D)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 29  */
#define   PORT_EVCTRL_PID1_PIN30_Val          _UINT32_(0x1E)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 30  */
#define   PORT_EVCTRL_PID1_PIN31_Val          _UINT32_(0x1F)                                       /* (PORT_EVCTRL) Event actions will be executed on pin 31  */
#define PORT_EVCTRL_PID1_PIN0                 (PORT_EVCTRL_PID1_PIN0_Val << PORT_EVCTRL_PID1_Pos)  /* (PORT_EVCTRL) Event actions will be executed on pin 0 Position */
#define PORT_EVCTRL_PID1_PIN1                 (PORT_EVCTRL_PID1_PIN1_Val << PORT_EVCTRL_PID1_Pos)  /* (PORT_EVCTRL) Event actions will be executed on pin 1 Position */
#define PORT_EVCTRL_PID1_PIN2                 (PORT_EVCTRL_PID1_PIN2_Val << PORT_EVCTRL_PID1_Pos)  /* (PORT_EVCTRL) Event actions will be executed on pin 2 Position */
#define PORT_EVCTRL_PID1_PIN3                 (PORT_EVCTRL_PID1_PIN3_Val << PORT_EVCTRL_PID1_Pos)  /* (PORT_EVCTRL) Event actions will be executed on pin 3 Position */
#define PORT_EVCTRL_PID1_PIN4                 (PORT_EVCTRL_PID1_PIN4_Val << PORT_EVCTRL_PID1_Pos)  /* (PORT_EVCTRL) Event actions will be executed on pin 4 Position */
#define PORT_EVCTRL_PID1_PIN5                 (PORT_EVCTRL_PID1_PIN5_Val << PORT_EVCTRL_PID1_Pos)  /* (PORT_EVCTRL) Event actions will be executed on pin 5 Position */
#define PORT_EVCTRL_PID1_PIN6                 (PORT_EVCTRL_PID1_PIN6_Val << PORT_EVCTRL_PID1_Pos)  /* (PORT_EVCTRL) Event actions will be executed on pin 6 Position */
#define PORT_EVCTRL_PID1_PIN7                 (PORT_EVCTRL_PID1_PIN7_Val << PORT_EVCTRL_PID1_Pos)  /* (PORT_EVCTRL) Event actions will be executed on pin 7 Position */
#define PORT_EVCTRL_PID1_PIN8                 (PORT_EVCTRL_PID1_PIN8_Val << PORT_EVCTRL_PID1_Pos)  /* (PORT_EVCTRL) Event actions will be executed on pin 8 Position */
#define PORT_EVCTRL_PID1_PIN9                 (PORT_EVCTRL_PID1_PIN9_Val << PORT_EVCTRL_PID1_Pos)  /* (PORT_EVCTRL) Event actions will be executed on pin 9 Position */
#define PORT_EVCTRL_PID1_PIN10                (PORT_EVCTRL_PID1_PIN10_Val << PORT_EVCTRL_PID1_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 10 Position */
#define PORT_EVCTRL_PID1_PIN11                (PORT_EVCTRL_PID1_PIN11_Val << PORT_EVCTRL_PID1_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 11 Position */
#define PORT_EVCTRL_PID1_PIN12                (PORT_EVCTRL_PID1_PIN12_Val << PORT_EVCTRL_PID1_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 12 Position */
#define PORT_EVCTRL_PID1_PIN13                (PORT_EVCTRL_PID1_PIN13_Val << PORT_EVCTRL_PID1_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 13 Position */
#define PORT_EVCTRL_PID1_PIN14                (PORT_EVCTRL_PID1_PIN14_Val << PORT_EVCTRL_PID1_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 14 Position */
#define PORT_EVCTRL_PID1_PIN15                (PORT_EVCTRL_PID1_PIN15_Val << PORT_EVCTRL_PID1_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 15 Position */
#define PORT_EVCTRL_PID1_PIN16                (PORT_EVCTRL_PID1_PIN16_Val << PORT_EVCTRL_PID1_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 16 Position */
#define PORT_EVCTRL_PID1_PIN17                (PORT_EVCTRL_PID1_PIN17_Val << PORT_EVCTRL_PID1_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 17 Position */
#define PORT_EVCTRL_PID1_PIN18                (PORT_EVCTRL_PID1_PIN18_Val << PORT_EVCTRL_PID1_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 18 Position */
#define PORT_EVCTRL_PID1_PIN19                (PORT_EVCTRL_PID1_PIN19_Val << PORT_EVCTRL_PID1_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 19 Position */
#define PORT_EVCTRL_PID1_PIN20                (PORT_EVCTRL_PID1_PIN20_Val << PORT_EVCTRL_PID1_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 20 Position */
#define PORT_EVCTRL_PID1_PIN21                (PORT_EVCTRL_PID1_PIN21_Val << PORT_EVCTRL_PID1_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 21 Position */
#define PORT_EVCTRL_PID1_PIN22                (PORT_EVCTRL_PID1_PIN22_Val << PORT_EVCTRL_PID1_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 22 Position */
#define PORT_EVCTRL_PID1_PIN23                (PORT_EVCTRL_PID1_PIN23_Val << PORT_EVCTRL_PID1_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 23 Position */
#define PORT_EVCTRL_PID1_PIN24                (PORT_EVCTRL_PID1_PIN24_Val << PORT_EVCTRL_PID1_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 24 Position */
#define PORT_EVCTRL_PID1_PIN25                (PORT_EVCTRL_PID1_PIN25_Val << PORT_EVCTRL_PID1_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 25 Position */
#define PORT_EVCTRL_PID1_PIN26                (PORT_EVCTRL_PID1_PIN26_Val << PORT_EVCTRL_PID1_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 26 Position */
#define PORT_EVCTRL_PID1_PIN27                (PORT_EVCTRL_PID1_PIN27_Val << PORT_EVCTRL_PID1_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 27 Position */
