vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/port.h
#define PORT_EVCTRL_PID3_PIN10                (PORT_EVCTRL_PID3_PIN10_Val << PORT_EVCTRL_PID3_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 10 Position */
#define PORT_EVCTRL_PID3_PIN11                (PORT_EVCTRL_PID3_PIN11_Val << PORT_EVCTRL_PID3_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 11 Position */
#define PORT_EVCTRL_PID3_PIN12                (PORT_EVCTRL_PID3_PIN12_Val << PORT_EVCTRL_PID3_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 12 Position */
#define PORT_EVCTRL_PID3_PIN13                (PORT_EVCTRL_PID3_PIN13_Val << PORT_EVCTRL_PID3_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 13 Position */
#define PORT_EVCTRL_PID3_PIN14                (PORT_EVCTRL_PID3_PIN14_Val << PORT_EVCTRL_PID3_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 14 Position */
#define PORT_EVCTRL_PID3_PIN15                (PORT_EVCTRL_PID3_PIN15_Val << PORT_EVCTRL_PID3_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 15 Position */
#define PORT_EVCTRL_PID3_PIN16                (PORT_EVCTRL_PID3_PIN16_Val << PORT_EVCTRL_PID3_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 16 Position */
#define PORT_EVCTRL_PID3_PIN17                (PORT_EVCTRL_PID3_PIN17_Val << PORT_EVCTRL_PID3_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 17 Position */
#define PORT_EVCTRL_PID3_PIN18                (PORT_EVCTRL_PID3_PIN18_Val << PORT_EVCTRL_PID3_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 18 Position */
#define PORT_EVCTRL_PID3_PIN19                (PORT_EVCTRL_PID3_PIN19_Val << PORT_EVCTRL_PID3_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 19 Position */
#define PORT_EVCTRL_PID3_PIN20                (PORT_EVCTRL_PID3_PIN20_Val << PORT_EVCTRL_PID3_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 20 Position */
#define PORT_EVCTRL_PID3_PIN21                (PORT_EVCTRL_PID3_PIN21_Val << PORT_EVCTRL_PID3_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 21 Position */
#define PORT_EVCTRL_PID3_PIN22                (PORT_EVCTRL_PID3_PIN22_Val << PORT_EVCTRL_PID3_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 22 Position */
#define PORT_EVCTRL_PID3_PIN23                (PORT_EVCTRL_PID3_PIN23_Val << PORT_EVCTRL_PID3_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 23 Position */
#define PORT_EVCTRL_PID3_PIN24                (PORT_EVCTRL_PID3_PIN24_Val << PORT_EVCTRL_PID3_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 24 Position */
#define PORT_EVCTRL_PID3_PIN25                (PORT_EVCTRL_PID3_PIN25_Val << PORT_EVCTRL_PID3_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 25 Position */
#define PORT_EVCTRL_PID3_PIN26                (PORT_EVCTRL_PID3_PIN26_Val << PORT_EVCTRL_PID3_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 26 Position */
#define PORT_EVCTRL_PID3_PIN27                (PORT_EVCTRL_PID3_PIN27_Val << PORT_EVCTRL_PID3_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 27 Position */
#define PORT_EVCTRL_PID3_PIN28                (PORT_EVCTRL_PID3_PIN28_Val << PORT_EVCTRL_PID3_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 28 Position */
#define PORT_EVCTRL_PID3_PIN29                (PORT_EVCTRL_PID3_PIN29_Val << PORT_EVCTRL_PID3_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 29 Position */
#define PORT_EVCTRL_PID3_PIN30                (PORT_EVCTRL_PID3_PIN30_Val << PORT_EVCTRL_PID3_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 30 Position */
#define PORT_EVCTRL_PID3_PIN31                (PORT_EVCTRL_PID3_PIN31_Val << PORT_EVCTRL_PID3_Pos) /* (PORT_EVCTRL) Event actions will be executed on pin 31 Position */
#define PORT_EVCTRL_EVACT3_Pos                _UINT32_(29)                                         /* (PORT_EVCTRL) Event 3 Action Position */
#define PORT_EVCTRL_EVACT3_Msk                (_UINT32_(0x3) << PORT_EVCTRL_EVACT3_Pos)            /* (PORT_EVCTRL) Event 3 Action Mask */
#define PORT_EVCTRL_EVACT3(value)             (PORT_EVCTRL_EVACT3_Msk & (_UINT32_(value) << PORT_EVCTRL_EVACT3_Pos)) /* Assignment of value for EVACT3 in the PORT_EVCTRL register */
#define   PORT_EVCTRL_EVACT3_OUT_Val          _UINT32_(0x0)                                        /* (PORT_EVCTRL) The output value of pin PIDn will be set to the level of the event  */
#define   PORT_EVCTRL_EVACT3_SET_Val          _UINT32_(0x1)                                        /* (PORT_EVCTRL) Set the output value of pin PIDn on the rising edge of the event  */
#define   PORT_EVCTRL_EVACT3_CLR_Val          _UINT32_(0x2)                                        /* (PORT_EVCTRL) Clear the output value of pin PIDn on the rising edge of the event  */
#define   PORT_EVCTRL_EVACT3_TGL_Val          _UINT32_(0x3)                                        /* (PORT_EVCTRL) Toggle the output value of pin PIDn on the rising edge of the event  */
#define PORT_EVCTRL_EVACT3_OUT                (PORT_EVCTRL_EVACT3_OUT_Val << PORT_EVCTRL_EVACT3_Pos) /* (PORT_EVCTRL) The output value of pin PIDn will be set to the level of the event Position */
#define PORT_EVCTRL_EVACT3_SET                (PORT_EVCTRL_EVACT3_SET_Val << PORT_EVCTRL_EVACT3_Pos) /* (PORT_EVCTRL) Set the output value of pin PIDn on the rising edge of the event Position */
#define PORT_EVCTRL_EVACT3_CLR                (PORT_EVCTRL_EVACT3_CLR_Val << PORT_EVCTRL_EVACT3_Pos) /* (PORT_EVCTRL) Clear the output value of pin PIDn on the rising edge of the event Position */
#define PORT_EVCTRL_EVACT3_TGL                (PORT_EVCTRL_EVACT3_TGL_Val << PORT_EVCTRL_EVACT3_Pos) /* (PORT_EVCTRL) Toggle the output value of pin PIDn on the rising edge of the event Position */
#define PORT_EVCTRL_PORTEI3_Pos               _UINT32_(31)                                         /* (PORT_EVCTRL) PORT Event 3 Input Enable Position */
#define PORT_EVCTRL_PORTEI3_Msk               (_UINT32_(0x1) << PORT_EVCTRL_PORTEI3_Pos)           /* (PORT_EVCTRL) PORT Event 3 Input Enable Mask */
#define PORT_EVCTRL_PORTEI3(value)            (PORT_EVCTRL_PORTEI3_Msk & (_UINT32_(value) << PORT_EVCTRL_PORTEI3_Pos)) /* Assignment of value for PORTEI3 in the PORT_EVCTRL register */
#define PORT_EVCTRL_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (PORT_EVCTRL) Register Mask  */


/* -------- PORT_PMUX : (PORT Offset: 0x30) (R/W 8) Peripheral Multiplexing # -------- */
#define PORT_PMUX_RESETVALUE                  _UINT8_(0x00)                                        /*  (PORT_PMUX) Peripheral Multiplexing #  Reset Value */

